hotelize-app/app/Http/Controllers/HotelController.php

    public function index()
    {
        $hotels = Hotel::all();
---
select * from `hotels` where `hotels`.`deleted_at` is null