hotelize-app/app/Http/Controllers/HotelController.php

    public function index()
    {
        $hotels = Hotel::orderBy('name')->get();
---
select * from `hotels` where `hotels`.`deleted_at` is null order by `name` asc

    public function store(HotelRequest $request)
    {
        try{
            $hotel = Hotel::create($request->validated());
---
insert into `hotels` (`name`, `address`, `city`, `state`, `zip_code`, `website`, `updated_at`, `created_at`) values ('ATest', 'Rua Das Tulipas', 'Montes Claros', 'MG', '39400000', 'https://www.kutch.net/vel-assumenda-cum-in-et-consequatur-ut', '2024-06-30 07:28:24', '2024-06-30 07:28:24')

    public function show(string $id)
    {
        $hotel = Hotel::findOrFail($id);
---
select * from `hotels` where `hotels`.`id` = '9' and `hotels`.`deleted_at` is null limit 1

    public function update(HotelRequest $request, string $id)
    {
        try{
            $hotel = Hotel::findOrFail($id);
            $hotel->update($request->validated());
---
select * from `hotels` where `hotels`.`id` = '19' and `hotels`.`deleted_at` is null limit 1
update `hotels` set `name` = 'Test', `hotels`.`updated_at` = '2024-06-30 07:28:59' where `id` = 19

    public function destroy(string $id)
    {
        try{
            $hotel = Hotel::findOrFail($id);
            $hotel->delete();
---
select * from `hotels` where `hotels`.`id` = '10' and `hotels`.`deleted_at` is null limit 1
update `hotels` set `deleted_at` = '2024-06-30 07:28:38', `hotels`.`updated_at` = '2024-06-30 07:28:38' where `id` = 10