hotelize-app/app/Http/Controllers/RoomController.php

    public function store(RoomRequest $request)
    {
        $room = Room::create($request->validated());
---
insert into `rooms` (`hotel_id`, `name`, `description`, `updated_at`, `created_at`) values ('19', 'Outro quarto', 'teste', '2024-06-30 07:29:51', '2024-06-30 07:29:51')

    public function show(string $id)
    {
        $room = Room::findOrFail($id);
---
select * from `rooms` where `rooms`.`id` = '2' and `rooms`.`deleted_at` is null limit 1

    public function update(RoomRequest $request, string $id)
    {
        $room = Room::findOrFail($id);
        $room->update($request->validated());
---
select * from `rooms` where `rooms`.`id` = '51' and `rooms`.`deleted_at` is null limit 1
update `rooms` set `deleted_at` = '2024-06-30 06:49:57', `rooms`.`updated_at` = '2024-06-30 06:49:57' where `id` = 51