hotelize-app/app/Http/Controllers/UserController.php

    public function store(UserRequest $request)
    {
        $user = User::create($request->all());
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Hugo Barbosa Santos', 'hugocorone10@gmail.com', '$2y$12$ZYcf8lNVQxiHIRu/EPwMi.Hwp7Fw15gyYgN5dWV6SCVCsziMC5uwK', '2024-06-30 03:44:19', '2024-06-30 03:44:19')

    public function show(string $id)
    {
        $user = User::findOrFail($id);
---
select * from `users` where `users`.`id` = '12' limit 1

    public function update(Request $request, string $id)
    {
        $user = User::findOrFail($id);
        $user->update($request->all());
---
select * from `users` where `users`.`id` = '12' limit 1
update `users` set `email` = 'hugocorone11@gmail.com', `users`.`updated_at` = '2024-06-30 07:46:58' where `id` = 12

    public function destroy(string $id)
    {
        try {
            $user = User::findOrFail($id);
            $user->delete();
---
select * from `users` where `users`.`id` = '9' limit 1
delete from `users` where `id` = 9